## apply() Function
- df_name[["ColumnLable"]] --> DataFrame
- df_name["ColumnLable"]   --> series
- Syntax

    - df_name[["ColumnLable"]].apply(func)
    - df_name[["ColumnLable"]].apply(func)

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(
    {
        "Col1" : np.array([1,2,3,4,5]),
        "Col2" : np.array([10,20,30,40,50])
    }
)
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [3]:
display("series",df["Col1"])

'series'

0    1
1    2
2    3
3    4
4    5
Name: Col1, dtype: int32

In [4]:
display("DataFrame",df[["Col1"]])

'DataFrame'

   Col1
0     1
1     2
2     3
3     4
4     5

In [5]:
x = lambda x : x**2
x(2)

4

In [6]:
df[["Col1"]].apply(lambda x : x**2)

   Col1
0     1
1     4
2     9
3    16
4    25

In [7]:
df[["Col2"]]

   Col2
0    10
1    20
2    30
3    40
4    50

In [8]:
ndf = df[["Col2"]].apply(lambda x : x % 2)

In [9]:
ndf

   Col2
0     0
1     0
2     0
3     0
4     0

In [10]:
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [11]:
def value(num):
    num = "ML"
    return num

In [12]:
new_d  = pd.DataFrame(df["Col1"].apply(value))

In [13]:
new_d

  Col1
0   ML
1   ML
2   ML
3   ML
4   ML

In [14]:
df

   Col1  Col2
0     1    10
1     2    20
2     3    30
3     4    40
4     5    50

In [15]:
cnt = pd.DataFrame(
    {
        "Country":["India","UK","USA"],
        "Capital":["Delhi","London","Washington DF"]
    }
)
cnt

  Country        Capital
0   India          Delhi
1      UK         London
2     USA  Washington DF

In [16]:
def capital(value):
    if type(value) == object:
        return value.upper()

In [17]:
cnt['Country'].apply(lambda x : x.upper())

0    INDIA
1       UK
2      USA
Name: Country, dtype: object

In [18]:
cnt[0:].apply(capital)

Country    None
Capital    None
dtype: object

In [19]:
df.apply(lambda x : x**2)

   Col1  Col2
0     1   100
1     4   400
2     9   900
3    16  1600
4    25  2500

In [20]:
cnt

  Country        Capital
0   India          Delhi
1      UK         London
2     USA  Washington DF

In [24]:
cnt["Country"].apply(lambda x : x.upper())
# cnt["Capital"].apply(lambda y : y.upper())
cnt

  Country        Capital
0   INDIA          DELHI
1      UK         LONDON
2     USA  WASHINGTON DF

In [23]:
for i in cnt.index:
    cnt.iloc[i] = cnt.iloc[i].apply(lambda x : x.upper())

In [26]:
for i in cnt:
    print(cnt[i].apply(str.lower),end=" ")

0    india
1       uk
2      usa
Name: Country, dtype: object 0            delhi
1           london
2    washington df
Name: Capital, dtype: object

In [29]:
cnt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  3 non-null      object
 1   Capital  3 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [36]:
cnt = pd.DataFrame(
    {
        "Country":["India","UK","USA"],
        "Capital":["Delhi",np.nan,"Washington DF"]
    }
)
cnt

  Country        Capital
0   India          Delhi
1      UK            NaN
2     USA  Washington DF

In [31]:
cnt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  3 non-null      object
 1   Capital  2 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [32]:
cnt.isna().sum()

Country    0
Capital    1
dtype: int64